[
    {
        "id":"PC2017001",
        "title":"Prod Squad",
        "img":"/imgs/projects/prodsquad/prodsquad.png",
        "alt":"Site web promotionnel d'une communauté française du jeux-vidéos minecraft privée",

        "date" : "Été 2018",
        "role" : "Conception site web",
        "categ":"prestation",
        "context": "Avant même mes études ou mes premières expériences professionnelles, j’ai eu la chance de rejoindre une communauté privée de passionnés de Minecraft appelée Prod'Squad. Cette équipe organisait régulièrement des événements en ligne comme des UHC ou des cités, intégralement développés en command blocks. À cette époque, je découvrais tout juste le monde de la création numérique, et j’avais envie de contribuer à faire rayonner notre communauté. C’est dans cet esprit que j’ai proposé de créer un site web vitrine, afin de lui donner une visibilité extérieure, poser une image cohérente et professionnelle, et attirer de nouveaux joueurs. Ce projet a marqué le tout début de mon parcours dans le web, avec l’envie de créer quelque chose de concret et utile pour un groupe auquel je tenais.",
        "description": "Réalisé en 2018 avec Wix, ce site web a été ma toute première création publique. J’y ai mis toute mon énergie et ma curiosité pour proposer une plateforme claire, structurée et fidèle à l’identité de la communauté. Le site présentait l’univers de Prod'Squad, son équipe, les événements passés et à venir, des témoignages de membres fidèles, ainsi qu’un formulaire de contact, les chaînes Twitch et YouTube des membres, un accès au règlement et même la possibilité de faire un don pour soutenir la communauté. À travers ce projet, j’ai découvert l’importance d’une navigation intuitive, d’une hiérarchie de l’information bien pensée, et d’une cohérence visuelle. Bien qu’il s’agisse d’un projet sans code, cette expérience a été une vraie porte d’entrée dans le monde du web. C’est là que j’ai compris que j’aimais donner vie à des idées et construire des espaces digitaux pensés pour l’utilisateur, dans un cadre humain, passionné et communautaire.",
        "retour": "",
        "collaborateurs": [],
        "doc": "",
        "link": "https://marwin-rdgs25.wixsite.com/prodsquad",
        "repos": "",
        "img1": "/imgs/projects/prodsquad/img1.JPG",
        "img2": "/imgs/projects/prodsquad/img2.JPG",
        "img3": "",
        "previous": "PC2025004",
        "next": "PS2017001",
        "tools": ["wix"],

        "presta": "",
        "keywords": ["Prod Squad", "Communauté Minecraft privée", "Événements Minecraft UHC", "Cités Minecraft", "Minecraft France", "Site web vitrine Minecraft", "Promotion communauté gaming", "Jeux vidéo multijoueur", "Command blocks Minecraft", "Équipe Minecraft française", "Organisation d’événements Minecraft", "Twitch Minecraft", "YouTube Minecraft", "Conception site web Wix", "Site web Wix gaming", "Projet web étudiant", "Première création web", "Navigation intuitive site web", "Identité visuelle gaming", "Expérience utilisateur site vitrine", "Passion jeux vidéo et web", "Site communautaire Minecraft", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Gestion de projet", "Digital", "Communication", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"] 
    },
    {
        "id":"PS2017001",
        "title":"Trois Cent Team",
        "img":"/imgs/projects/troiscentteam/troiscentteam.jpg",
        "alt":"Site de présentation d'un groupe de 3 élèves",

        "date":"Été 2018",
        "role": "Étudiant",
        "categ":"school",
        "context": "En classe de seconde au lycée Cuvier de Montbéliard, j’ai eu l’opportunité de suivre l’option ICN (Informatique et Création Numérique), une découverte pour moi à l’époque. C’est dans ce cadre qu’un projet de groupe nous a été confié : créer un site web type portfolio en équipe, pour regrouper et présenter l’ensemble des travaux réalisés pendant l’année. Ce fut ma toute première expérience de création numérique dans un cadre scolaire, et surtout l’un des premiers projets où il a fallu collaborer, structurer un site de A à Z, et surtout comprendre l’intérêt de rendre un contenu lisible, accessible et engageant pour les visiteurs.",
        "description": "Réalisé en 2018 avec Wix, le site Trois Cent Team avait pour vocation de présenter notre parcours en ICN. En équipe avec Thomas et Jordan, nous avons conçu une plateforme simple et complète, présentant chacun des membres, nos projets et nos apprentissages. On y retrouve notamment : une introduction de l’équipe, la liste de nos réalisations durant l’année : une œuvre artistique en fils tendus réalisée sur Scratch, nos premiers pas en HTML/CSS, et une présentation approfondie sur la robotique en entreprise, un blog permettant de suivre l’évolution du projet, un formulaire de contact intégré avec une carte de localisation du lycée, un chat en direct pour discuter en temps réel, et un espace utilisateur pour créer un compte et interagir. Ce projet, bien qu’encadré dans un cadre scolaire, m’a permis de comprendre très tôt le fonctionnement d’un CMS comme Wix, de toucher à des notions concrètes de design, d’UX, d’organisation de contenu et de collaboration. Il a marqué l’un de mes premiers pas vers le monde du web, dans un contexte à la fois ludique, pédagogique et motivant.",
        "retour": "",
        "collaborateurs": ["ThomasBouvais","Jordan"],
        "doc": "",
        "link": "https://marwin-rdgs25.wixsite.com/no-aim",
        "repos": "",
        "img1": "/imgs/projects/troiscentteam/img1.JPG",
        "img2": "/imgs/projects/troiscentteam/img2.JPG",
        "img3": "/imgs/projects/troiscentteam/img3.JPG",
        "previous": "PC2017001",
        "next": "PP2022001",
        "tools": ["wix"],

        "presta": "",
        "keywords":["Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Gestion de projet", "Digital", "Communication", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain","Trois Cent Team","Projet scolaire","Option ICN","Lycée Cuvier Montbéliard","Création numérique","Site portfolio","Travaux d'étudiants","Collaboration en équipe","Thomas Bouvais","Jordan","Wix","Développement web","HTML CSS débutant","Scratch fils tendus","Robotique en entreprise","Blog projet","Formulaire contact","Carte localisation lycée","Chat en direct","Espace utilisateur","CMS Wix","Design web","UX","Organisation contenu","Présentation équipe","Apprentissage web","Projet pédagogique","Projet web étudiant","Contenu accessible","Site web lisible","Première expérience numérique","Marwin Rodrigues","Développement site web scolaire","Conception site web","Projet de groupe"]
    },
    {
        "id":"PP2022001",
        "title":"Stweaming",
        "img":"/imgs/projects/stweaming/stweaming.jpg",
        "alt":"Site de streaming",

        "date": "Février 2022",
        "role": "Fondateur",
        "categ":"perso",
        "context": "À la suite de ma première année de BTS SIO, où j’ai commencé à maîtriser les bases de la programmation web, orientée objet, et la gestion de bases de données, j’ai eu envie de me lancer dans un projet plus personnel. C’est en analysant le paysage des plateformes de streaming que l’idée de Stweaming est née : je me suis rendu compte qu’il n’existait pas de plateforme centralisée permettant d’accéder à l’ensemble des contenus diffusés sur Netflix, Disney+, Amazon Prime Video, Canal+… Chacune de ces plateformes propose ses exclusivités, mais l’utilisateur est souvent contraint de jongler entre plusieurs abonnements et interfaces. C’est là que j’ai eu envie de créer une plateforme unifiée — un mix entre un site de streaming classique et un outil de gestion comme MyAnimeList, mais élargi à tous types de contenus : animes, films, dessins animés, séries, etc.",
        "description": "Stweaming est un projet personnel imaginé après ma première année de BTS SIO, avec l’envie de créer une plateforme de streaming unifiée regroupant tous types de contenus : animes, films, dessins animés, séries... Inspiré par l’idée de fusionner un site de streaming classique avec les fonctionnalités sociales d’un outil comme MyAnimeList, j’ai conçu une première version en HTML, CSS et JavaScript pour le front-end, avec PHP et une base de données MySQL gérée via phpMyAdmin pour le back-end. L’interface a été stylisée grâce à Bootstrap et Bootswatch. L’utilisateur pouvait créer des playlists personnalisées, noter les contenus, commenter, enregistrer ses personnages préférés et retrouver un catalogue fictif pensé pour offrir une vraie expérience sociale autour du divertissement. Bien que le projet ait été mis en pause, il reste une idée que je compte bien développer à l’avenir, avec une roadmap déjà réfléchie et pleine de fonctionnalités originales.",
        "retour": "",
        "collaborateurs": [],
        "doc": "",
        "link": "",
        "repos": "https://github.com/Marwin-Rdgs/Stweaming",
        "img1": "",
        "img2": "",
        "img3": "",
        "previous": "PS2017001",
        "next": "PP2022002",
        "tools": ["html", "css", "js", "php","bootstrap","bootswatch", "phpmyadmin", "SQLite"],

        "presta": "",
        "keywords": ["Stweaming", "plateforme de streaming unifiée", "site de streaming", "gestion de contenus", "animes", "films", "dessins animés", "séries", "MyAnimeList", "HTML", "CSS", "JavaScript", "PHP", "MySQL", "phpMyAdmin", "Bootstrap", "Bootswatch", "playlist personnalisée", "notation contenus", "commentaires", "expérience sociale", "catalogue fictif", "projet personnel", "roadmap fonctionnalités", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Gestion de projet", "Digital", "Communication", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"]
    },
    {
        "id":"PP2022002",
        "title":"Template Footer - Waves",
        "img":"/imgs/projects/footer_wave.jpg",
        "alt":"Template d'un bas de page vague",

        "date": "Janvier 2022",
        "role": "Fondateur",
        "categ":"perso",
        "context": "Durant ma formation en BUT MMI, j’ai souvent remarqué que mes camarades rencontraient des difficultés à créer des sections de site web soignées et personnalisables. J’ai donc décidé de leur venir en aide en réalisant des templates simples et adaptables, notamment pour les parties souvent négligées comme les footers. C’est dans cette logique que j’ai conçu ce projet : fournir un pied de page moderne, esthétique et facile à modifier pour tous.",
        "description": "Ce projet personnel consistait à reproduire et adapter un footer à effet 'vagues' que j’avais repéré en ligne, dans le but de le rendre simple d’utilisation et de personnalisation pour mes camarades. Réalisé en HTML, CSS et JavaScript natif, ce template permet de modifier facilement les textes, les couleurs, les liens, les icônes ou encore l’arrière-plan. Le code est commenté avec pédagogie pour faciliter sa compréhension, même pour des débutants. L’objectif était de créer un composant esthétique et fonctionnel, réutilisable dans différents projets sans difficulté.",
        "retour": "",
        "collaborateurs": [],
        "doc": "",
        "link": "",
        "repos": "https://github.com/Marwin-Rdgs/Animated_Footer-Template",
        "img1": "",
        "img2": "",
        "img3": "",
        "previous": "PP2022001",
        "next": "PC2022001",
        "tools": ["html", "css", "js"],

        "presta": "",
        "keywords": ["Template Footer", "Footer Waves", "bas de page vague", "template HTML CSS JavaScript", "composant réutilisable", "design moderne", "effet vague", "personnalisation facile", "code commenté pédagogique", "accessibilité débutants", "projet personnel", "section site web", "template adaptable", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Gestion de projet", "Digital", "Communication", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"]
    },
    {
        "id":"PC2022001",
        "title":"Citadelle de Besançon",
        "img":"/imgs/projects/citadelle.jpg",
        "alt":"Illustration animée de la citadelle de Besançon",

        "date": "2022",
        "role": "Étudiant",
        "categ":"school",
        "context": "Dans le cadre de ma formation en BUT MMI, un exercice pédagogique nous a été proposé autour de l’illustration. L’objectif était de représenter la Citadelle de Besançon dans un style graphique choisi. Ayant été très inspiré par l’univers visuel du jeu Firewatch, j’ai immédiatement souhaité m’en inspirer : j’adorais le mélange de couleurs chaudes, de paysages en aplats, et cette atmosphère calme et immersive. Cet exercice avait pour but de nous faire progresser dans notre capacité à adapter un style graphique existant, mais aussi à explorer notre propre sensibilité artistique.",
        "description": "J’ai commencé par illustrer la Citadelle de Besançon en m’appuyant sur l’identité visuelle du jeu Firewatch, avec ses paysages superposés en tons chauds et ses formes simplifiées. L’illustration a été entièrement réalisée sur Adobe Illustrator, en jouant sur les contrastes de plans et les dégradés de teintes pour retrouver l’ambiance du jeu. Une fois l’illustration finalisée, je l’ai animée avec HTML et CSS natif : légers mouvements de décors, effets de profondeur ou encore variations d’opacité pour apporter de la vie à la scène. Cet exercice m’a permis de mieux comprendre comment traduire un univers graphique en une création personnelle, tout en développant mes compétences en animation web sans JavaScript.",
        "retour": "",
        "collaborateurs": [],
        "doc": "",
        "link": "https://citadelle-besancon.marwin-rodrigues.fr/",
        "repos": "",
        "img1": "",
        "img2": "",
        "img3": "",
        "previous": "PP2022002",
        "next": "PC2022002",
        "tools": ["html", "css", "illustrator"],

        "presta": "",
        "keywords": ["Citadelle de Besançon", "illustration animée", "style graphique Firewatch", "paysages en aplats", "couleurs chaudes", "atmosphère immersive", "Adobe Illustrator", "animation HTML CSS", "effets de profondeur", "dégradés de teintes", "création personnelle", "animation web sans JavaScript", "exercice pédagogique", "BUT MMI", "projet étudiant", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Gestion de projet", "Digital", "Communication", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"]
    },
    {
        "id":"PC2022002",
        "title":"go-match",
        "img":"/imgs/projects/gomatch/gomatch.gif",
        "alt":"Site web de gestion de terrain de sport",

        "date": "Juin 2022",
        "role": "Chef de projet & Développeur web",
        "categ":"school",
        "context": "Dans le cadre du second semestre du BUT MMI, un projet de groupe nous a été confié avec pour objectif de créer un service numérique utile. C’est avec Eliot Feuvrier et Théo Pasquarelli que nous avons décidé d’imaginer GoMatch, une plateforme permettant aux passionnés de sport de se retrouver facilement sur des terrains multisports. Notre idée partait d’un constat simple : il est souvent difficile d’organiser ou de rejoindre des parties sportives spontanées autour de chez soi. J’ai donc pris en charge la gestion de projet ainsi que le développement web, avec une réelle volonté de créer un service fonctionnel, intuitif, et porté par une identité forte.",
        "description": "Nous avons commencé par définir l’identité graphique de GoMatch via Adobe Illustrator pour le branding, et Figma pour la maquette du site. Côté technique, j’ai développé l’entièreté du site web avec HTML, CSS et JavaScript en m’appuyant sur VueJS pour l’architecture front-end, TailwindCSS pour le design, AlpineJS pour les animations interactives et Netlify pour le déploiement continu via GitHub. La géolocalisation des terrains a été implémentée grâce à OpenStreetMap, et l’ensemble des réservations était stocké dans une base de données NoSQL Firebase. Les utilisateurs pouvaient réserver un terrain en précisant le sport et le nombre de joueurs, ou rejoindre une partie existante. Un espace utilisateur simplifié permettait de suivre ses matchs et ses engagements. Trello a été utilisé pour le suivi de projet, garantissant une gestion fluide des tâches et des deadlines. En quelques mois, nous avons donné vie à un projet fictif mais profondément ancré dans la réalité, porté par des étudiants motivés à créer une expérience utile, moderne et fonctionnelle.",
        "retour": "",
        "collaborateurs": ["EliotFeuvrier","TheoPasquarelli"],
        "doc": "https://docs.google.com/presentation/d/1SEaD67q4R1k7FidrDfNCyZFdpunQQv5x1U8sHn2xuxQ/edit?usp=sharing",
        "link": "https://gomatch.marwin-rodrigues.fr/",
        "repos": "https://github.com/Marwin-Rdgs/GoMatch.fr",
        "img1": "/imgs/projects/gomatch/img1.JPG",
        "img2": "/imgs/projects/gomatch/img2.JPG",
        "img3": "",
        "previous": "PC2022001",
        "next": "PS2023001",
        "tools": ["vue","tailwind","js","figma","alpine","firebase","github","trello","openstreetmap"],

        "presta": "",
        "keywords": ["go-match", "gestion terrain sport", "plateforme multisports", "réservation terrain", "VueJS", "TailwindCSS", "AlpineJS", "Firebase NoSQL", "OpenStreetMap", "Netlify", "GitHub", "Trello", "Adobe Illustrator", "Figma", "branding", "maquette", "expérience utilisateur", "gestion de projet", "développement web", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Gestion de projet", "Digital", "Communication", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"]
    },
    {
        "id":"PS2023001",
        "title":"e-morphoz",
        "img":"/imgs/projects/emorphoz/emorphoz.gif",
        "alt":"Générateur de NFT",

        "date": "Décembre 2022",
        "role": "Développeur web",
        "categ":"school",
        "context": "Lors du troisième semestre du BUT MMI, nous avons été amenés à concevoir un générateur de NFT dans le cadre d’un projet en équipe. Le sujet pouvait potentiellement être présenté au festival OFFF en Espagne, ce qui nous a poussés à viser un rendu professionnel. Nous étions cinq étudiants : Alicia Iversenc (cheffe de projet), Morgane Chamberlin (chargée de communication), Bryan Ferry (designer UI), Maxime Paris (branding designer) et moi-même en tant que développeur web. Partant du constat que la majorité des gens sont sensibles à l’écologie mais que les NFT sont énergivores, nous avons voulu créer une solution plus responsable. C’est ainsi qu’est né E-Morphoz : un générateur de NFT collaboratif et écoresponsable, alliant personnalisation et technologie verte.",
        "description": "E-Morphoz permet à l’utilisateur de générer une NFT en personnalisant une coccinelle 3D, avec des accessoires (bagues et pins) et un fond influencé par la température extérieure de sa localisation. Chaque revente de la NFT redistribue une partie des bénéfices à l’utilisateur et à une association. Côté design, Figma a été utilisé pour la maquette, Blender pour la modélisation 3D, Adobe Illustrator pour le logo, Photoshop pour les accessoires et fonds, Substance 3D Painter pour l’application de textures (herbe, pierre…), et Substance 3D Stager pour l’éclairage des scènes. Le site a été hébergé sur PlanetHoster, choisi pour son engagement écologique via l’usage d’énergies vertes. La base de données a été gérée avec Supabase, et les NFTs stockés sur la blockchain Tezos, reconnue pour sa faible empreinte carbone et son langage Michelson adapté aux smart contracts. Côté gestion de projet, nous avons utilisé Trello, Drive, Discord et Gantt Project pour structurer nos livrables et suivre les deadlines. E-Morphoz a ainsi mêlé innovation technologique, engagement écologique et expérience utilisateur gamifiée autour d’un sujet au cœur des préoccupations actuelles.",
        "retour": "",
        "collaborateurs": ["AliciaIversinc", "MorganeChamberlin","MaximeParis","BryanFerry"],
        "doc": "https://drive.google.com/file/d/1V8l1vpnRiYibO4J6oVFJy24BSQvJjsK9/view?usp=sharing",
        "link": "https://emorphoz.marwin-rodrigues.fr/",
        "repos": "https://github.com/emorphoz/emorphoz.net",
        "img1": "/imgs/projects/emorphoz/img1.JPG",
        "img2": "/imgs/projects/emorphoz/img2.JPG",
        "img3": "/imgs/projects/emorphoz/img3.JPG",
        "previous": "PC2022002",
        "next": "PC2023001",
        "tools": ["vue","tailwind","adobe","figma", "github", "supabase", "openweathermap", "trello"],

        "presta": "",
        "keywords": ["e-morphoz", "générateur NFT", "NFT écoresponsable", "personnalisation 3D", "coccinelle 3D", "accessoires NFT", "fond dynamique", "température extérieure", "Tezos blockchain", "Michelson smart contracts", "Supabase", "PlanetHoster énergie verte", "Blender", "Substance 3D Painter", "Substance 3D Stager", "Adobe Illustrator", "Photoshop", "Figma", "Trello", "Drive", "Discord", "Gantt Project", "gestion de projet", "gamification", "innovation technologique", "engagement écologique", "expérience utilisateur", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Gestion de projet", "Digital", "Communication", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"]
    },
    {
        "id":"PC2023001",
        "title":"Carte de visite - MToutFer",
        "img":"/imgs/projects/Com-MToutFer.jpeg",
        "alt":"Carte de visite pour un entrepreneur dans le débaras",

        "date": "Été 2024",
        "role": "Agent de communication",
        "categ":"prestation",
        "context": "Un auto-entrepreneur spécialisé dans le débarras (ferrailles, encombrants, etc.) m’a contacté afin d’améliorer sa visibilité et sa communication locale. N’ayant jusque-là aucun support visuel professionnel, il souhaitait pouvoir toucher une clientèle plus large, notamment via le bouche-à-oreille et les supports physiques. J’ai ainsi été sollicité pour concevoir une identité graphique simple, efficace et déclinable sur différents supports imprimés.",
        "description": "J’ai réalisé une carte de visite claire et percutante avec ses coordonnées, son activité et un design professionnel, facilement mémorisable. Un flyer au format A5 a été conçu pour être distribué localement, mettant en avant ses prestations, ses tarifs attractifs et ses zones d’intervention. Enfin, j’ai réalisé une grande affiche publicitaire à coller directement sur sa camionnette, afin d’en faire un support de communication mobile et visible. L’ensemble du projet a été conçu sur Adobe Illustrator et Photoshop, avec une charte graphique adaptée à son domaine (couleurs visibles, typographies lisibles, pictogrammes explicites). Ce projet a permis à l’auto-entrepreneur de renforcer sa présence locale et de se professionnaliser dans sa communication.",
        "retour": "Marwin a été très compétent et il a répondu à mes attentes qui m'ont permis de me concentrer totalement sur mon activité d'auto-entreprise.",
        "collaborateurs": [],
        "doc": "",
        "link": "",
        "repos": "",
        "img1": "",
        "img2": "",
        "img3": "",
        "previous": "PS2023001",
        "next": "PC2024001",
        "tools": ["adobe"],

        "presta": "web",
        "keywords": ["Carte de visite", "flyer", "affiche publicitaire", "identité graphique", "communication locale", "auto-entrepreneur", "débarras", "ferrailles", "encombrants", "Adobe Illustrator", "Adobe Photoshop", "design professionnel", "charte graphique", "support imprimé", "communication mobile", "visibilité", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Gestion de projet", "Digital", "Communication", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"]
    },
    {
        "id":"PC2024001",
        "title":"Flyer - Tony RODRIGUES",
        "img":"/imgs/projects/Com-Tony.jpeg",
        "alt":"Prestation d'une réalisation de flyer",

        "date":"Été 2024",
        "role": "Agent de communication",
        "categ":"prestation",
        "context": "Un auto-entrepreneur spécialisé dans le nettoyage intérieur de véhicules m’a sollicité afin de l’aider à lancer son activité avec une image de marque professionnelle et percutante. Il avait besoin d’attirer de nouveaux clients localement et de se démarquer de la concurrence, notamment grâce à une direction artistique forte et des supports visuels convaincants à distribuer ou afficher.",
        "description": "J’ai pris en charge la création complète de son univers visuel : élaboration d’une direction artistique cohérente, choix d’une palette de couleurs moderne et dynamique, typographies lisibles et impactantes, et conception d’un logo professionnel. À partir de cette identité visuelle, j’ai ensuite conçu un flyer au format A5, optimisé pour capter l’attention et présenter clairement ses services, ses points forts (rapidité, minutie, disponibilité) et ses coordonnées. Le design, réalisé sur Adobe Illustrator et Photoshop, respecte les standards visuels du secteur automobile tout en véhiculant une image haut de gamme et soignée. Grâce à ce projet, l’auto-entrepreneur a pu renforcer la crédibilité de son activité et attirer une clientèle plus large et mieux ciblée.",
        "retour": "J'ai fait appel à Marwin pour des flyers, et je suis ravi du résultat. Créatif et efficace, il a parfaitement compris mes besoins. Je recommande vivement ses services !",
        "collaborateurs": [],
        "doc": "",
        "link": "",
        "repos": "",
        "img1": "",
        "img2": "",
        "img3": "",
        "previous": "PC2023001",
        "next": "PS2023002",
        "tools": ["adobe"],

        "presta": "web",
        "keywords": ["flyer", "direction artistique", "identité visuelle", "logo", "palette de couleurs", "typographies", "design graphique", "communication visuelle", "secteur automobile", "image de marque", "supports visuels", "auto-entrepreneur", "local", "clientèle ciblée", "Adobe Illustrator", "Adobe Photoshop", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Gestion de projet", "Digital", "Communication", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"]
    },
    {
        "id":"PS2023002",
        "title":"iut NFC tv",
        "img":"/imgs/projects/iutnfctv/iutNFCTV.gif",
        "alt":"Projet scolaire d'un site web de la web tv de l'iut nord franche comté",

        "date": "Décembre 2023",
        "role": "Chef de projet & Développeur web",
        "categ":"school",
        "context": "Dans le cadre du 5e semestre de la formation BUT MMI, nous avons été chargés de concevoir un site web pour l’IUT Nord Franche-Comté. L’objectif était de répondre à un besoin concret exprimé par M. Alain Lamboux-Durand : centraliser l’ensemble des contenus médias produits par l’IUT (vidéos, podcasts, photos, etc.). En effet, à ce jour, ces médias sont éparpillés entre le site principal de l’IUT, une chaîne YouTube et divers réseaux sociaux, rendant leur accès peu intuitif et souvent frustrant pour les étudiants, les enseignants et le personnel. Le site principal, quant à lui, souffrait d’une interface vieillissante et trop dense. Ce projet est donc né d’une volonté de recentrer et de moderniser la diffusion des contenus informatifs de l’établissement, dans une optique de clarté, d’ergonomie et de cohésion interne.",
        "description": "Nous avons conçu un site web d’information moderne et épuré, dédié à la centralisation des contenus médias de l’IUT Nord Franche-Comté. Le projet a été réalisé en équipe : Hugo Beaurain (développeur), Bryan Ferry et Allan Hienne (UI & branding designers), Lucas Thomesse (communicant) et moi-même en tant que développeur et chef de projet web. Nous avons d’abord analysé le cahier des charges pour cerner les besoins et les objectifs clés : accès rapide à l’information, mise en avant des formats vidéo/podcast, ergonomie, cohésion sociale et lutte contre la désinformation. Pour organiser notre travail, nous avons utilisé Discord pour la communication interne, Trello pour la gestion des tâches, Gantt Project pour la planification et Google Drive pour le partage des ressources. En matière de conception, Figma a servi au maquettage graphique, tandis qu’Illustrator, Photoshop, Premiere Pro et Media Encoder ont été employés pour créer l’univers visuel et les assets. Côté développement, nous avons construit un thème WordPress sur mesure, en SCSS, avec WAMP pour le local testing. Nous avons aussi utilisé Looping pour la modélisation des données, HappyScribe pour les transcriptions audio, Visual Paradigm pour les cas d’usage, MindMeister pour l’arborescence du site, et Selenium pour les tests fonctionnels. Ce projet a été une occasion concrète de mettre en pratique une gestion de projet complète et de collaborer de manière pluridisciplinaire dans un cadre semi-professionnel.",
        "retour": "",
        "collaborateurs": ["AllanHienne","BryanFerry","HugoBeaurain","LucaThomesse"],
        "doc": "https://drive.google.com/file/d/1Vjzd0XLQN38mQEAPULErYO-k6uOO6Hbu/view?usp=sharing",
        "link": "https://iutnfctv.beaurain-hugo.fr/",
        "repos":"",
        "img1": "/imgs/projects/iutnfctv/img1.JPG",
        "img2": "/imgs/projects/iutnfctv/img2.JPG",
        "img3": "/imgs/projects/iutnfctv/img3.JPG",
        "previous": "PC2024001",
        "next": "PC2024002",
        "tools": ["php", "scss","wordpress","tailwind","adobe","figma", "github", "trello", "selenium"],

        "presta": "",
        "keywords": ["site web", "web tv", "contenus médias", "vidéos", "podcasts", "photos", "centralisation", "ergonomie", "gestion de projet", "communication interne", "travail en équipe", "WordPress", "SCSS", "WAMP", "Figma", "Illustrator", "Photoshop", "Premiere Pro", "Media Encoder", "Looping", "HappyScribe", "Visual Paradigm", "MindMeister", "Selenium", "développement web", "chef de projet", "pluridisciplinaire", "semi-professionnel", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Digital", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"]
    },
    {
        "id":"PC2024002",
        "title":"Anthony Hecquet Portfolio",
        "img":"/imgs/projects/AnthonyHecquet-Portfolio.JPG",
        "alt":"Portfolio d'un étudiant de BTS SIO nommé Anthony Hecquet",

        "date": "Avril 2025",
        "role":"Conception site web",
        "categ":"prestation",
        "context": "Anthony Hecquet, étudiant en BTS SIO (option SISR), m’a contacté dans l’urgence pour développer son portfolio professionnel en ligne dans un délai très serré de 4 jours. Ce portfolio devait respecter les consignes de sa formation tout en étant moderne et optimisé. J’ai accepté le défi avec enthousiasme, motivé par l’envie de démontrer ma réactivité, ma rigueur et ma capacité à gérer un projet technique sous pression.",
        "description": "Le projet a débuté par un brief clair et concis avec Anthony, accompagné de visios régulières pour m'assurer que chaque étape du développement correspondait parfaitement à ses attentes. J’ai d’abord mis en place deux environnements : une préproduction (site privé) afin de lui permettre de suivre l’avancée du projet et valider les ajustements en temps réel, et une production finale pour la version publique, accessible et livrée dans les délais. Pour la stack technique, j’ai utilisé NuxtJS afin de garantir un front-end performant et dynamique, TailwindCSS pour une mise en page moderne et responsive, et Animate.CSS pour enrichir l’interface avec des animations fluides. Le déploiement a été automatisé grâce à GitHub et Netlify, assurant une CI/CD fluide et fiable. En seulement 8 heures de développement effectif, le site a été entièrement conçu, testé et mis en ligne. Le résultat est un portfolio professionnel, soigné et conforme aux attentes académiques du BTS, avec un excellent retour de la part du client.",
        "retour": "J’ai demandé à Marwin de m’aider pour le projet de mon portfolio dans un délai de 4 jours. Il a su parfaitement réagir et prendre en compte toutes mes demandes  tout en me proposant des idées d’optimisation",
        "collaborateurs": [],
        "doc": "",
        "link": "",
        "repos": "https://github.com/Marwin-Rdgs/PC004-Dexter",
        "img1": "",
        "img2": "",
        "img3": "",
        "previous": "PS2023002",
        "next": "PC2025001",
        "tools": ["html","css","js","tailwind"],

        "presta": "web",
        "keywords": ["portfolio", "BTS SIO", "SISR", "développement web", "NuxtJS", "TailwindCSS", "Animate.CSS", "CI/CD", "GitHub", "Netlify", "réactivité", "gestion de projet", "front-end", "responsive", "site web", "conception", "déploiement automatisé", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Digital", "Communication", "SEO", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"]
    },
    {
        "id":"PC2025001",
        "title":"ANS2P",
        "img":"/imgs/projects/ANS2P/ANS2P.jpg",
        "alt":"Site web promotionnel d'une société de nettoyage",

        "date": "Avril 2025",
        "role": "Conception site web",
        "categ":"prestation",
        "context": "En tant que technico-commercial web chez l’agence 13ème étage à Belfort, j’ai été sollicité pour créer le site internet de l’entreprise ANS2P, spécialisée en nettoyage écoresponsable. Ce client, nouvellement créé en mai 2024 et présent dans la région Belfort‑Montbéliard, souhaitait renforcer sa visibilité, affirmer son positionnement durable et offrir une interface moderne à ses prospects et clients.",
        "description": "J’ai conçu un site WordPress avec le builder Avada, entièrement personnalisé pour mettre en avant les atouts d’ANS2P : produits certifiés ECOCERT, eau osmosée, intervention rapide et engagement local. Le site présente son offre complète (bureaux, véhicules, fin de chantier, etc.), intègre des témoignages clients authentiques, une carte de zone d’intervention, et un formulaire de contact clair. La direction artistique valorise son image écoresponsable tout en respectant la charte de l’agence 13ème étage. Le site a été optimisé SEO local et mobile, garantissant une navigation fluide et un bon référencement dans le Territoire de Belfort, le Doubs, le Haut-Rhin et la Haute-Saône",
        "retour": "",
        "collaborateurs": [],
        "doc": "",
        "link": "https://ans2p.fr/",
        "repos": "",
        "img1": "/imgs/projects/ANS2P/img1.JPG",
        "img2": "/imgs/projects/ANS2P/img2.JPG",
        "img3": "/imgs/projects/ANS2P/img3.JPG",
        "previous": "PC2024002",
        "next": "PC2025003",
        "tools": ["wordpress", "avada", "figma"],

        "presta": "web",
        "keywords": ["nettoyage écoresponsable", "WordPress", "Avada", "SEO local", "optimisation mobile", "direction artistique", "charte graphique", "témoignages clients", "carte d’intervention", "formulaire de contact", "durabilité", "Territoire de Belfort", "Doubs", "Haut-Rhin", "Haute-Saône", "site web promotionnel", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Gestion de projet", "Digital", "Communication", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"]
    },
    {
        "id":"PC2025003",
        "title":"ilMago",
        "img":"/imgs/projects/ilMago/ilMago.gif",
        "alt":"Site web promotionnel d'un DJ et producteur de Hardstyle Strasbourgeois",
        "categ":"prestation",

        "date": "Avril 2025",
        "role": "Conception site web",
        "context": "ilMago, DJ et producteur Hardstyle basé à Strasbourg, m’a contacté dans le cadre de sa montée en puissance sur la scène électro. L’objectif : construire une présence en ligne à la hauteur de son univers artistique, puissant, percutant et singulier. Il souhaitait un site web à la fois promotionnel et immersif, capable de présenter ses sets, ses clips, ses prochains événements et son identité sonore auprès du grand public comme des professionnels du milieu musical.",
        "description": "Pour répondre à cette demande, j’ai conçu un site web sur-mesure, à son image : vif, immersif et sans détour. Le projet s’est articulé autour de trois piliers : l’expérience utilisateur, la performance technique et la fidélité à l’univers musical d’ilMago. J’ai accompagné l’artiste dès les premières étapes pour formaliser ses besoins : structure du site, contenu à valoriser (tracks, clips), ambiance visuelle à adopter. En collaboration étroite avec Allan Hienne, nous avons défini une direction artistique puissante : visuels sombres, typographies percutantes, animations rythmées — un écho direct à son identité de producteur Hardstyle. Le site a été développé avec NuxtJS pour garantir un chargement ultra rapide, une navigation fluide et une architecture optimisée pour le SEO. Le design, peaufiné grâce à SCSS, intègre des animations légères et des effets de transition pour renforcer l'immersion. Une attention particulière a été portée à l’optimisation mobile : chaque section a été pensé pour s’adapter à tous les supports, avec un rendu fluide aussi bien sur ordinateur que sur smartphone. Côté infrastructure, l’hébergement a été confié à Infomaniak. Côté référencement, j’ai mis en place une stratégie SEO complète : hiérarchisation du contenu, méta-données adaptées, balises optimisées, mais aussi GEO et préparation du site pour l’indexation IA (rich snippets, microdonnées structurées), afin de maximiser sa visibilité aussi bien sur Google que sur les moteurs d’IA émergents. Tout au long du projet, les échanges avec ilMago ont été fluides, dans une ambiance pro mais détendue, faite de réactivité, de confiance mutuelle et d’écoute. Le résultat ? Un site impactant, rapide et à son image, pensé pour évoluer avec sa carrière et séduire à la fois ses fans et les professionnels du milieu.",
        "retour": "J'ai confié la création de mon premier site web à Marwin, et j'ai été bluffé de la qualité de son travail ! Marwin est très carré, force de proposition et rapide. Super personnalité et rapport qualité/prix imbattable, je recommande ++ !",
        "collaborateurs": ["AllanHienne"],
        "doc": "",
        "link": "https://ilmago.fr/",
        "repos": "",
        "img1": "/imgs/projects/ilMago/img1.JPG",
        "img2": "/imgs/projects/ilMago/img2.JPG",
        "img3": "/imgs/projects/ilMago/gallerie.jpg",
        "previous": "PC2025001",
        "next": "PC2025004",
        "tools": ["nuxt","scss","github"],

        "presta": "web",
        "keywords": ["DJ", "producteur Hardstyle", "musique électro", "site promotionnel", "strasbourg", "expérience utilisateur", "performance technique", "direction artistique", "animations rythmées", "SEO avancé", "optimisation mobile", "rich snippets", "microdonnées structurées", "hébergement Infomaniak", "nuxtjs", "scss", "github", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Gestion de projet", "Digital", "Communication", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"]
    },
    {
        "id":"PC2025004",
        "title":"Soirée Canap",
        "img":"/imgs/projects/SoireeCanap/SoireeCanap.png",
        "alt":"Talk Show sur scène à Montbéliard autour de la formation BUT MMI",

        "date": "Juin 2025",
        "role": "Chargé de production, Responsable Logistique & Billetterie, Animateur",
        "categ":"prestation",
        "context": "Soirée Canap est née de la volonté de prolonger et d’élever les précédents projets audiovisuels portés par Jules Dupaquier, avec l’ambition constante de se challenger à chaque nouvelle édition. Dans un esprit de dépassement collectif et de progression personnelle, le projet visait à faire mieux, plus grand et plus impactant. Cette initiative avait également pour but de valoriser l’entrepreneuriat chez les jeunes, de prouver qu’avec de la motivation, de la rigueur et une bonne cohésion d’équipe, des projets ambitieux peuvent voir le jour. Enfin, Soirée Canap s’est inscrite dans une démarche solidaire en soutenant une cause qui nous tient à cœur, renforçant ainsi le sens de cette aventure.",
        "description": "Soirée Canap a mobilisé une équipe pluridisciplinaire composée d'étudiants passionnés et engagés. Durant plusieurs mois, nous avons travaillé sur la préparation de ce talk-show en gérant la production, la logistique, la scénarisation, la technique, la communication et la direction artistique. Le jour J, l'événement a pris vie devant un public en salle et en streaming, mêlant humour, débats, interviews et interventions surprises. L’ambiance sur scène et en coulisses a été portée par une énergie collective incroyable. Après le show, nous avons continué à valoriser le projet via des publications, des retours d’expérience et des échanges avec notre audience. Cette aventure humaine, technique et créative a marqué un véritable tournant dans nos parcours respectifs.",
        "retour": "",
        "collaborateurs": ["JulesDupaquier","DanyGalmiche","BanjaminBobel","NinoDaSilva","ZoeVicat","JaelAmemoutou","TimeoBinda","GaspardBondy","FlorianGoerig","FlorianHoutmann","SamuelCharasse","HugoBeaurain","EthanHennequin","BenoitFasel","FarisHalepovic","JulesHoubron","LucasChipaux","AlexandreGarnier"],
        "doc": "",
        "link": "https://taap.it/soireecanapvod",
        "repos": "",
        "img1": "/imgs/projects/SoireeCanap/img1.jpg",
        "img2": "/imgs/projects/SoireeCanap/img2.jpg",
        "img3": "/imgs/projects/SoireeCanap/img3.png",
        "previous":"PC2025003",
        "next":"PC2017001",
        "tools": ["infomaniakEvents"],

        "presta": "web",
        "keywords": ["talk show", "production événementielle", "logistique", "billetterie", "animation", "scénarisation", "technique audiovisuelle", "communication événementielle", "direction artistique", "streaming", "énergie collective", "entrepreneuriat jeune", "cohésion d'équipe", "projet solidaire", "Montbéliard", "Marwin Rodrigues", "Business Manager", "Entrepreneur", "Développeur Web", "Gestion de projet", "Digital", "Communication", "SEO", "NuxtJS", "TailwindCSS", "Chez Marwin Web", "Chez Marwin TeamCare", "Chez Marwin Union", "Auto-entreprise", "Agence de communication", "Freelance", "Strasbourg", "Divonne les bains", "Montbéliard", "Doubs", "Bas-rhin", "Ain"]
    }
]