[
    {
        "id":"PC2017001",
        "title":"Prod Squad",
        "img":"/imgs/projects/prodsquad.png",
        "alt":"Site web promotionnel d'une communauté française du jeux-vidéos minecraft privée",
        "categ":"prestation",
        "tools": ["wix"]
    },
    {
        "id":"PS2017001",
        "title":"Trois Cent Team",
        "img":"/imgs/projects/troiscentteam.jpg",
        "alt":"Site de présentation d'un groupe de 3 élèves",
        "categ":"school",
        "tools": ["wordpress"]
    },
    {
        "id":"PP2022001",
        "title":"Stweaming",
        "img":"/imgs/projects/stweaming.jpg",
        "alt":"Site de streaming",
        "categ":"perso",
        "tools": ["php","bootstrap","bootswatch"]
    },
    {
        "id":"PP2022002",
        "title":"Template Footer - Waves",
        "img":"/imgs/projects/footer_wave.jpg",
        "alt":"Template d'un bas de page vague",
        "categ":"perso",
        "tools": ["html", "css"]
    },
    {
        "id":"PC2022001",
        "title":"Citadelle de Besançon",
        "img":"/imgs/projects/citadelle.jpg",
        "alt":"Illustration animée de la citadelle de Besançon",
        "categ":"school",
        "tools": ["html", "css", "illustrator"]
    },
    {
        "id":"PC2022002",
        "title":"go-match",
        "img":"/imgs/projects/gomatch.gif",
        "alt":"Site web de gestion de terrain de sport",
        "categ":"school",
        "tools": ["vue","tailwind","js","figma","alpine","firebase","github","trello","openstreetmap"]
    },
    {
        "id":"PS2023001",
        "title":"e-morphoz",
        "img":"/imgs/projects/emorphoz.gif",
        "alt":"Générateur de NFT",
        "categ":"school",
        "tools": ["vue","tailwind","adobe","figma", "github", "supabase", "openweathermap", "trello"]
    },
    {
        "id":"PC2023001",
        "title":"Carte de visite - MToutFer",
        "img":"/imgs/projects/Com-MToutFer.jpeg",
        "alt":"Carte de visite pour un entrepreneur dans le débaras",
        "categ":"prestation",
        "tools": ["adobe"]
    },
    {
        "id":"PC2024001",
        "title":"Flyer - Tony RODRIGUES",
        "img":"/imgs/projects/Com-Tony.jpeg",
        "alt":"Prestation d'une réalisation de flyer",
        "categ":"prestation",
        "tools": ["adobe"]
    },
    {
        "id":"PS2023002",
        "title":"iut NFC tv",
        "img":"/imgs/projects/iutNFCTV.gif",
        "alt":"Projet scolaire d'un site web de la web tv de l'iut nord franche comté",
        "categ":"school",
        "tools": ["php", "scss","wordpress","tailwind","adobe","figma", "github", "trello", "selenium"]
    },
    {
        "id":"PC2024002",
        "title":"Anthony Hecquet Portfolio",
        "img":"/imgs/projects/AnthonyHecquet-Portfolio.JPG",
        "alt":"Portfolio d'un étudiant de BTS SIO nommé Anthony Hecquet",
        "categ":"prestation",
        "tools": ["html","css","js","tailwind"]
    },
    {
        "id":"PC2025001",
        "title":"ANS2P",
        "img":"/imgs/projects/ANS2P.jpg",
        "alt":"Site web promotionnel d'une société de nettoyage",
        "categ":"prestation",
        "tools": ["wordpress", "avada", "figma"]
    },
    {
        "id":"PC2025003",
        "title":"ilMago",
        "img":"/imgs/projects/ilMago/ilMago.gif",
        "alt":"Site web promotionnel d'un DJ et producteur de Hardstyle Strasbourgeois",
        "categ":"prestation",

        "date": "Avril 2025",
        "role": "Développeur Web",
        "context": "ilMago, DJ et producteur Hardstyle basé à Strasbourg, m’a contacté dans le cadre de sa montée en puissance sur la scène électro. L’objectif : construire une présence en ligne à la hauteur de son univers artistique, puissant, percutant et singulier. Il souhaitait un site web à la fois promotionnel et immersif, capable de présenter ses sets, ses clips, ses prochains événements et son identité sonore auprès du grand public comme des professionnels du milieu musical.",
        "description": "Pour répondre à cette demande, j’ai conçu un site web sur-mesure, à son image : vif, immersif et sans détour. Le projet s’est articulé autour de trois piliers : l’expérience utilisateur, la performance technique et la fidélité à l’univers musical d’ilMago. J’ai accompagné l’artiste dès les premières étapes pour formaliser ses besoins : structure du site, contenu à valoriser (tracks, clips), ambiance visuelle à adopter. En collaboration étroite avec Allan Hienne, nous avons défini une direction artistique puissante : visuels sombres, typographies percutantes, animations rythmées — un écho direct à son identité de producteur Hardstyle. Le site a été développé avec NuxtJS pour garantir un chargement ultra rapide, une navigation fluide et une architecture optimisée pour le SEO. Le design, peaufiné grâce à SCSS, intègre des animations légères et des effets de transition pour renforcer l'immersion. Une attention particulière a été portée à l’optimisation mobile : chaque section a été pensé pour s’adapter à tous les supports, avec un rendu fluide aussi bien sur ordinateur que sur smartphone. Côté infrastructure, l’hébergement a été confié à Infomaniak. Côté référencement, j’ai mis en place une stratégie SEO complète : hiérarchisation du contenu, méta-données adaptées, balises optimisées, mais aussi GEO et préparation du site pour l’indexation IA (rich snippets, microdonnées structurées), afin de maximiser sa visibilité aussi bien sur Google que sur les moteurs d’IA émergents. Tout au long du projet, les échanges avec ilMago ont été fluides, dans une ambiance pro mais détendue, faite de réactivité, de confiance mutuelle et d’écoute. Le résultat ? Un site impactant, rapide et à son image, pensé pour évoluer avec sa carrière et séduire à la fois ses fans et les professionnels du milieu.",
        "retour": "J'ai confié la création de mon premier site web à Marwin, et j'ai été bluffé de la qualité de son travail ! Marwin est très carré, force de proposition et rapide. Super personnalité et rapport qualité/prix imbattable, je recommande ++ !",
        "doc": "",
        "link": "https://ilmago.fr/",
        "repos": "",
        "img1": "/imgs/projects/ilMago/img1.JPG",
        "img2": "/imgs/projects/ilMago/img2.JPG",
        "img3": "/imgs/projects/ilMago/gallerie.jpg",
        "previous": "PC2025001",
        "next": "PC2025004",
        "tools": ["nuxt","scss","github"]
    },
    {
        "id":"PC2025004",
        "title":"Soirée Canap",
        "img":"/imgs/projects/SoireeCanap.png",
        "alt":"Talk Show sur scène à Montbéliard autour de la formation BUT MMI",
        "categ":"prestation",
        "tools": ["infomaniakEvents"]
    }
]